Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentCreating
Subscribe to the DocumentCreating event to be notified when Revit is just about to create a new document.
Remarks:
This event is raised when Revit is just about to create a new document.
Event is cancellable. To cancel it, call the 'Cancel()' method of event's argument to True.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The document cannot be modified, for it is not created yet at the time of the event.
The following API functions are not available for the current document during this event:
Autodesk.Revit.ApplicationServices.Application.NewProjectDocument(System.String)Autodesk.Revit.ApplicationServices.Application.NewFamilyDocument(System.String)Autodesk.Revit.ApplicationServices.Application.NewProjectTemplateDocument(System.String)Autodesk.Revit.ApplicationServices.Application.OpenDocumentFile(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another Autodesk.Revit.ApplicationServices.Application.DocumentCreated event will be raised immediately after document
creation is finished.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.SetLibraryPaths(System.Collections.Generic.IDictionary`2{System.String,System.String})
Sets path information identifying where Revit searches for content.
Remarks:
The map that
is returned should contain a key that is purpose of the path, such as Material Libraries and the value
in the map is the fully qualified path to be used for that search path.
paths:
The map of library paths.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.ApplicationServices.ControlledApplication.CloudSharedLocalIncompatibleHandler
Subscribe to the CloudSharedLocalIncompatible event to be notified immediately after Revit has detected cloud shared local being incompatible.
Remarks:
This event is raised immediately after Revit has detected cloud shared local being incompatible.
It is raised even when cloud shared local being incompatible was detected.